StanXYZ03/DigitalTwin/STM32/Core/Src/m0_data_source.c
#include "m0_data_source.h"

#include <stddef.h>

#ifndef M0_FMC_PROTOCOL_TEST
#include "stm32h7xx_hal.h"
#include "fpga_autoconfig.h"
#endif

#define FMC16_BASE_ADDRESS             0x60000000UL
#define FMC16_SOF0                     0xA55AU
#define FMC16_SOF1                     0x5AA5U
#define FMC16_VERSION_HEADER           0x100DU
#define FMC16_TYPE_COMMAND             0x30U
#define FMC16_TYPE_RESPONSE            0x31U
#define FMC16_CHANNEL_COMMAND          0x0002U
#define FMC16_OPCODE_GET_STATUS        0x0003U
#define FMC16_OPCODE_SET_MODE          0x0004U
#define FMC16_SCHEMA_V1_0              0x0100U
#define FMC16_STATUS_OK                0x0000U
#define FMC16_COMMAND_WORDS            19U
#define FMC16_RESPONSE_WORDS           29U
#define FMC16_MODE_RESPONSE_WORDS      25U
#define FMC16_MIN_PACKET_WORDS         15U
#define FMC16_MAX_PACKET_WORDS         64U
#define FMC16_MAX_EMPTY_READS          4096U
#define FMC16_MAX_PACKETS_PER_QUERY    8U
#define FMC16_BRIDGE_SETTLE_US          5U
#define FMC16_VALID_PO                 0x0002U
#define FMC16_VALID_PIO                0x0004U
#define FMC16_VALID_MINIMUM            (FMC16_VALID_PO | FMC16_VALID_PIO)
#define FMC16_VALID_KNOWN_MASK         0x0307U
#define M0_CLOCK_SELECT                23U
#define M0_CLOCK_HZ                    12500000UL

volatile M0_FmcDebug m0_fmc_dbg;

/* One-shot hardware trace retained in RAM for ST-Link inspection.  It records
 * the first transaction only and does not add any extra FMC bus cycles. */
volatile uint16_t m0_fmc_rx_trace[256];
volatile uint16_t m0_fmc_tx_trace[32];
volatile uint32_t m0_fmc_rx_trace_count;
volatile uint32_t m0_fmc_tx_trace_count;
volatile uint32_t m0_po_history[64];
volatile uint32_t m0_timestamp_history[64];
volatile uint16_t m0_pio_history[64];
volatile uint32_t m0_value_history_count;

/* Kept outside the hardware-only section so the host protocol parser test
 * can verify the decoded requested PI fields as well. */
static uint16_t last_pi_applied;

#ifndef M0_FMC_PROTOCOL_TEST
static uint32_t next_command_sequence;
static uint32_t next_transaction_id;
static uint8_t pi_driver_ready;
static uint16_t virtual_pi_toggle;
static uint16_t virtual_key_state;
static uint16_t virtual_key_count;
static uint32_t last_control_id;
static uint8_t active_data_mode;
static uint16_t physical_pi_requested;

static uint8_t m0_sequence_is_newer(uint32_t candidate, uint32_t current)
{
    uint32_t delta;

    delta = candidate - current;
    return ((delta != 0U) && (delta < 0x80000000UL)) ? 1U : 0U;
}

/* M0 preserves the established exp2-01 event wiring.  M11 exposes F1..F9
 * as PI0..PI8 for the dot-matrix control engine. F10 is platform-only. */
static uint16_t m0_virtual_key_pi_bit(uint8_t f_number)
{
    uint32_t pi_index;

    if (f_number == 10U)
    {
        return 0U;
    }
    if ((active_data_mode == 11U) &&
        (f_number >= 1U) && (f_number <= 9U))
    {
        return (uint16_t)(1UL << (uint32_t)(f_number - 1U));
    }
    if ((f_number >= 1U) && (f_number <= 9U))
    {
        pi_index = 6U + (uint32_t)f_number;
    }
    else
    {
        return 0U;
    }
    return (uint16_t)(1UL << pi_index);
}

static void fmc16_delay_cycles(uint32_t cycles)
{
    uint32_t start;

    start = DWT->CYCCNT;
    while ((uint32_t)(DWT->CYCCNT - start) < cycles)
    {
        __NOP();
    }
}

static void fmc16_bridge_enable(void)
{
    /* PH8/Cloud_EN is active low.  Keep the bridge connected only for the
     * command/response transaction so normal SDRAM/LTDC traffic remains
     * isolated from the experiment connector. */
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_8, GPIO_PIN_RESET);
    __DSB();
    fmc16_delay_cycles(m0_fmc_dbg.bridge_settle_cycles);
    m0_fmc_dbg.bridge_enable_count++;
    m0_fmc_dbg.bridge_gpioh_odr = GPIOH->ODR;
}

static void fmc16_bridge_disable(void)
{
    __DSB();
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_8, GPIO_PIN_SET);
    __DSB();
    m0_fmc_dbg.bridge_gpioh_odr = GPIOH->ODR;
}

static uint16_t fmc16_read_word(void)
{
    uint16_t word;

    word = *(volatile uint16_t *)FMC16_BASE_ADDRESS;
    if (m0_fmc_rx_trace_count < 256U)
    {
        m0_fmc_rx_trace[m0_fmc_rx_trace_count++] = word;
    }
    m0_fmc_dbg.last_raw_word = word;
    m0_fmc_dbg.rx_word_count++;
    return word;
}

static void fmc16_write_word(uint16_t word)
{
    *(volatile uint16_t *)FMC16_BASE_ADDRESS = word;
    if (m0_fmc_tx_trace_count < 32U)
    {
        m0_fmc_tx_trace[m0_fmc_tx_trace_count++] = word;
    }
    m0_fmc_dbg.tx_word_count++;
}
#endif

static uint16_t fmc16_crc16_words(const uint16_t *words, size_t count)
{
    uint16_t crc;
    size_t i;
    int bit;

    crc = 0xFFFFU;
    for (i = 0U; i < count; ++i)
    {
        crc ^= words[i];
        for (bit = 0; bit < 16; ++bit)
        {
            crc = (uint16_t)(((crc & 0x8000U) != 0U)
                                 ? ((uint16_t)(crc << 1) ^ 0x1021U)
                                 : (uint16_t)(crc << 1));
        }
    }
    return crc;
}

static uint32_t fmc16_crc32_words(const uint16_t *words, size_t count)
{
    uint32_t crc;
    size_t i;
    int bit;

    crc = 0xFFFFFFFFUL;
    for (i = 0U; i < count; ++i)
    {
        for (bit = 15; bit >= 0; --bit)
        {
            uint32_t feedback;

            feedback = ((crc >> 31) ^
                        ((uint32_t)words[i] >> (uint32_t)bit)) & 1UL;
            crc = (feedback != 0UL) ? ((crc << 1) ^ 0x04C11DB7UL)
                                    : (crc << 1);
        }
    }
    return crc;
}

static void fmc16_build_command(uint16_t *packet,
                                uint32_t sequence,
                                uint32_t transaction,
                                uint16_t opcode,
                                uint16_t options)
{
    uint32_t crc32;

    packet[0] = FMC16_SOF0;
    packet[1] = FMC16_SOF1;
    packet[2] = FMC16_VERSION_HEADER;
    packet[3] = FMC16_COMMAND_WORDS;
    packet[4] = (uint16_t)(FMC16_TYPE_COMMAND << 8); /* no ACK_REQUIRED */
    packet[5] = 0x0001U; /* STM32 source, XO2 destination */
    packet[6] = FMC16_CHANNEL_COMMAND;
    packet[7] = 4U;
    packet[8] = (uint16_t)(sequence >> 16);
    packet[9] = (uint16_t)sequence;
    packet[10] = (uint16_t)(transaction >> 16);
    packet[11] = (uint16_t)transaction;
    packet[12] = fmc16_crc16_words(&packet[2], 10U);
    packet[13] = opcode;
    packet[14] = FMC16_SCHEMA_V1_0;
    packet[15] = options;
    packet[16] = 0U;
    crc32 = fmc16_crc32_words(&packet[2], 15U);
    packet[17] = (uint16_t)(crc32 >> 16);
    packet[18] = (uint16_t)crc32;
}

