StanXYZ03/DigitalTwin/STM32/Core/Src/m0_data_source.c
static void fmc16_build_status_command(uint16_t *packet,
                                       uint32_t sequence,
                                       uint32_t transaction)
{
    fmc16_build_command(packet, sequence, transaction,
                        FMC16_OPCODE_GET_STATUS, 0U);
}

static M0_FmcResult fmc16_validate_packet(const uint16_t *packet, size_t words)
{
    uint32_t received_crc;
    uint32_t expected_crc;

    if ((packet == NULL) || (words < FMC16_MIN_PACKET_WORDS) ||
        (packet[3] != words) ||
        (words != (size_t)(FMC16_MIN_PACKET_WORDS + packet[7])))
    {
        return M0_FMC_ERR_LENGTH;
    }
    if ((packet[0] != FMC16_SOF0) || (packet[1] != FMC16_SOF1))
    {
        return M0_FMC_ERR_RESPONSE;
    }
    if (packet[2] != FMC16_VERSION_HEADER)
    {
        return M0_FMC_ERR_VERSION;
    }
    if (fmc16_crc16_words(&packet[2], 10U) != packet[12])
    {
        return M0_FMC_ERR_HEADER_CRC;
    }
    expected_crc = fmc16_crc32_words(&packet[2], words - 4U);
    received_crc = ((uint32_t)packet[words - 2U] << 16) |
                   packet[words - 1U];
    if (expected_crc != received_crc)
    {
        return M0_FMC_ERR_PACKET_CRC;
    }
    return M0_FMC_OK;
}

#ifndef M0_FMC_PROTOCOL_TEST
static M0_FmcResult fmc16_capture_packet(uint16_t *packet,
                                         size_t *packet_words)
{
    uint32_t empty_reads;
    uint16_t word;
    size_t total;
    size_t i;

    empty_reads = 0U;
    *packet_words = 0U;
    while (empty_reads < FMC16_MAX_EMPTY_READS)
    {
        word = fmc16_read_word();
        if (word != FMC16_SOF0)
        {
            empty_reads++;
            continue;
        }
        packet[0] = word;

        word = fmc16_read_word();
        if (word == FMC16_SOF0)
        {
            packet[0] = word;
            word = fmc16_read_word();
        }
        if (word != FMC16_SOF1)
        {
            empty_reads++;
            continue;
        }

        packet[1] = word;
        packet[2] = fmc16_read_word();
        packet[3] = fmc16_read_word();
        total = packet[3];
        if ((total < FMC16_MIN_PACKET_WORDS) ||
            (total > FMC16_MAX_PACKET_WORDS))
        {
            return M0_FMC_ERR_LENGTH;
        }
        for (i = 4U; i < total; ++i)
        {
            packet[i] = fmc16_read_word();
        }
        *packet_words = total;
        return fmc16_validate_packet(packet, total);
    }

    m0_fmc_dbg.timeout_count++;
    return M0_FMC_ERR_TIMEOUT;
}
#endif

static M0_FmcResult fmc16_parse_status_response(const uint16_t *packet,
                                                size_t words,
                                                uint32_t transaction,
                                                M0_DataSnapshot *snapshot)
{
    uint16_t validity;
    uint32_t packet_transaction;
    M0_FmcResult result;

    if ((packet == NULL) || (snapshot == NULL))
    {
        return M0_FMC_ERR_ARGUMENT;
    }
    result = fmc16_validate_packet(packet, words);
    if (result != M0_FMC_OK)
    {
        return result;
    }
    if ((words != FMC16_RESPONSE_WORDS) ||
        ((uint8_t)(packet[4] >> 8) != FMC16_TYPE_RESPONSE) ||
        (packet[5] != 0x0100U) ||
        (packet[6] != FMC16_CHANNEL_COMMAND) ||
        (packet[7] != 14U))
    {
        return M0_FMC_ERR_RESPONSE;
    }

    packet_transaction = ((uint32_t)packet[10] << 16) | packet[11];
    if ((packet_transaction != transaction) ||
        (packet[13] != FMC16_OPCODE_GET_STATUS))
    {
        return M0_FMC_ERR_RESPONSE;
    }

    m0_fmc_dbg.response_status = packet[14];
    m0_fmc_dbg.response_detail = packet[15];
    m0_fmc_dbg.schema = packet[17];
    validity = packet[18];
    m0_fmc_dbg.validity = validity;

    if ((packet[14] != FMC16_STATUS_OK) ||
        (packet[16] != 10U) ||
        (packet[17] != FMC16_SCHEMA_V1_0))
    {
        return M0_FMC_ERR_RESPONSE;
    }
    if (((validity & FMC16_VALID_MINIMUM) != FMC16_VALID_MINIMUM) ||
        ((validity & (uint16_t)~FMC16_VALID_KNOWN_MASK) != 0U))
    {
        return M0_FMC_ERR_VALIDITY;
    }

    snapshot->sequence = ((uint32_t)packet[8] << 16) | packet[9];
    snapshot->timestamp_ms = ((uint32_t)packet[25] << 16) | packet[26];
    snapshot->po = ((uint32_t)packet[22] << 16) | packet[23];
    snapshot->pio = packet[24];
    snapshot->pi_requested = packet[19];
    snapshot->key_state = packet[20];
    snapshot->key_event_count = (uint16_t)(packet[21] & 0x0FFFU);
    snapshot->pi_applied = last_pi_applied;
    snapshot->mode = (uint8_t)(packet[21] >> 12U);
    snapshot->clk_sel = M0_CLOCK_SELECT;
    snapshot->clock_hz = M0_CLOCK_HZ;
    return M0_FMC_OK;
}

static M0_FmcResult fmc16_parse_mode_response(const uint16_t *packet,
                                              size_t words,
                                              uint32_t transaction,
                                              uint8_t requested_mode)
{
    uint32_t packet_transaction;
    M0_FmcResult result;

    if (packet == NULL)
    {
        return M0_FMC_ERR_ARGUMENT;
    }
    result = fmc16_validate_packet(packet, words);
    if (result != M0_FMC_OK)
    {
        return result;
    }
    if ((words != FMC16_MODE_RESPONSE_WORDS) ||
        ((uint8_t)(packet[4] >> 8) != FMC16_TYPE_RESPONSE) ||
        (packet[5] != 0x0100U) ||
        (packet[6] != FMC16_CHANNEL_COMMAND) ||
        (packet[7] != 10U))
    {
        return M0_FMC_ERR_RESPONSE;
    }
    packet_transaction = ((uint32_t)packet[10] << 16) | packet[11];
    if ((packet_transaction != transaction) ||
        (packet[13] != FMC16_OPCODE_SET_MODE) ||
        (packet[14] != FMC16_STATUS_OK) ||
        (packet[16] != 1U) ||
        (packet[17] != (uint16_t)requested_mode))
    {
        return M0_FMC_ERR_RESPONSE;
    }
    return M0_FMC_OK;
}

#ifndef M0_FMC_PROTOCOL_TEST
void M0_DataSource_Init(void)
{
    volatile uint8_t *debug_bytes;
    size_t i;

    debug_bytes = (volatile uint8_t *)&m0_fmc_dbg;
    for (i = 0U; i < sizeof(m0_fmc_dbg); ++i)
    {
        debug_bytes[i] = 0U;
    }
    next_command_sequence = 1U;
    next_transaction_id = 1U;
    last_pi_applied = 0U;
    virtual_pi_toggle = 0U;
    virtual_key_state = 0U;
    virtual_key_count = 0U;
    last_control_id = 0U;
    active_data_mode = 0U;
    physical_pi_requested = 0U;
    /* Reassert the safe value after configuration.  The same value was
     * established before PROGRAM_B was released, so this cannot create an
     * input edge in the user experiment. */
    pi_driver_ready = (FPGA_PI_Init() == HAL_OK) ? 1U : 0U;
    if (pi_driver_ready == 0U)
    {
        m0_fmc_dbg.pi_i2c_error_count++;
    }
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    m0_fmc_dbg.initialized = 1U;
    m0_fmc_dbg.fmc_bcr1 = FMC_Bank1_R->BTCR[0];
    m0_fmc_dbg.fmc_btr1 = FMC_Bank1_R->BTCR[1];
    m0_fmc_dbg.fmc_bwtr1 = FMC_Bank1E_R->BWTR[0];
    m0_fmc_dbg.bridge_settle_cycles =
        (SystemCoreClock / 1000000UL) * FMC16_BRIDGE_SETTLE_US;
}

uint8_t M0_DataSource_Read(M0_DataSnapshot *snapshot)
{
    uint16_t tx_packet[FMC16_COMMAND_WORDS];
    uint16_t rx_packet[FMC16_MAX_PACKET_WORDS];
    size_t rx_words;
    uint32_t transaction;
    uint32_t packet_index;
    uint32_t i;
    M0_FmcResult result;

    if (snapshot == NULL)
    {
        m0_fmc_dbg.last_result = M0_FMC_ERR_ARGUMENT;
        return 0U;
    }
    if (m0_fmc_dbg.initialized == 0U)
    {
        M0_DataSource_Init();
    }

    m0_fmc_dbg.read_attempts++;
    transaction = next_transaction_id++;
    m0_fmc_dbg.command_sequence = next_command_sequence;
    m0_fmc_dbg.transaction_id = transaction;
    fmc16_build_status_command(tx_packet, next_command_sequence++, transaction);

    fmc16_bridge_enable();
    for (i = 0U; i < FMC16_COMMAND_WORDS; ++i)
    {
        fmc16_write_word(tx_packet[i]);
    }
    __DSB();

    result = M0_FMC_ERR_TIMEOUT;
    for (packet_index = 0U;
         packet_index < FMC16_MAX_PACKETS_PER_QUERY;
         ++packet_index)
    {
        rx_words = 0U;
        result = fmc16_capture_packet(rx_packet, &rx_words);
        m0_fmc_dbg.last_result = result;
        m0_fmc_dbg.last_packet_words = (uint16_t)rx_words;
        if (result != M0_FMC_OK)
        {
            if (result == M0_FMC_ERR_TIMEOUT)
            {
                break;
            }
            if (result == M0_FMC_ERR_HEADER_CRC)
            {
                m0_fmc_dbg.header_crc_error_count++;
            }
            else if (result == M0_FMC_ERR_PACKET_CRC)
            {
                m0_fmc_dbg.packet_crc_error_count++;
            }
            else if (result == M0_FMC_ERR_LENGTH)
            {
                m0_fmc_dbg.length_error_count++;
            }
            m0_fmc_dbg.ignored_packets++;
            continue;
        }

        m0_fmc_dbg.last_packet_type = (uint16_t)(rx_packet[4] >> 8);
        m0_fmc_dbg.last_packet_transaction =
            ((uint32_t)rx_packet[10] << 16) | rx_packet[11];
        result = fmc16_parse_status_response(rx_packet, rx_words,
                                             transaction, snapshot);
        if (result == M0_FMC_OK)
        {
            uint32_t history_index;
            uint16_t target_pi;

            if (snapshot->mode != active_data_mode)
            {
                active_data_mode = snapshot->mode;
                virtual_pi_toggle = 0U;
                virtual_key_state = 0U;
            }
            physical_pi_requested = snapshot->pi_requested;
            if (active_data_mode == 11U)
            {
                /* M11 uses held levels so the unmodified point-matrix
                 * experiment sees one rising edge on press and a falling
                 * edge on release. Physical and web holds retain XOR
                 * arbitration. */
                target_pi = (uint16_t)(physical_pi_requested ^
                                       (virtual_key_state & 0x01FFU));
            }
            else
            {
                target_pi = (uint16_t)(physical_pi_requested ^
                                       virtual_pi_toggle);
            }

