StanXYZ03/DigitalTwin/STM32/Core/Src/m0_data_source.c
            if ((pi_driver_ready == 0U) ||
                (target_pi != last_pi_applied))
            {
                if ((pi_driver_ready == 0U) && (FPGA_PI_Init() == HAL_OK))
                {
                    pi_driver_ready = 1U;
                }
                if ((pi_driver_ready != 0U) &&
                    (FPGA_PI_Write(target_pi) == HAL_OK))
                {
                    last_pi_applied = target_pi;
                }
                else
                {
                    pi_driver_ready = 0U;
                    m0_fmc_dbg.pi_i2c_error_count++;
                }
            }
            snapshot->pi_applied = last_pi_applied;
            snapshot->pi_virtual_toggle = virtual_pi_toggle;
            snapshot->virtual_key_state = virtual_key_state;
            snapshot->virtual_key_count = virtual_key_count;
            snapshot->control_ack = last_control_id;

            m0_fmc_dbg.response_sequence = snapshot->sequence;
            m0_fmc_dbg.lattice_timestamp_ms = snapshot->timestamp_ms;
            m0_fmc_dbg.po = snapshot->po;
            m0_fmc_dbg.pio = snapshot->pio;
            if (snapshot->mode == 11U)
            {
                uint8_t heartbeat = (uint8_t)snapshot->po;

                m0_fmc_dbg.matrix_rows = snapshot->pio;
                m0_fmc_dbg.matrix_col = (uint8_t)(snapshot->po & 0x0FU);
                m0_fmc_dbg.matrix_scan_heartbeat = heartbeat;
                m0_fmc_dbg.matrix_diag_samples++;
                if (heartbeat != m0_fmc_dbg.matrix_previous_heartbeat)
                    m0_fmc_dbg.matrix_diag_changes++;
                m0_fmc_dbg.matrix_previous_heartbeat = heartbeat;
            }
            m0_fmc_dbg.pi_requested = snapshot->pi_requested;
            m0_fmc_dbg.pi_applied = snapshot->pi_applied;
            m0_fmc_dbg.key_state = snapshot->key_state;
            m0_fmc_dbg.key_event_count = snapshot->key_event_count;
            m0_fmc_dbg.current_mode = snapshot->mode;
            m0_fmc_dbg.pi_virtual_toggle = virtual_pi_toggle;
            m0_fmc_dbg.virtual_key_state = virtual_key_state;
            m0_fmc_dbg.virtual_key_count = virtual_key_count;
            m0_fmc_dbg.last_control_id = last_control_id;
            m0_fmc_dbg.read_successes++;
            m0_fmc_dbg.last_result = M0_FMC_OK;
            history_index = m0_value_history_count;
            if (history_index < 64U)
            {
                m0_po_history[history_index] = snapshot->po;
                m0_pio_history[history_index] = snapshot->pio;
                m0_timestamp_history[history_index] = snapshot->timestamp_ms;
                m0_value_history_count = history_index + 1U;
            }
            fmc16_bridge_disable();
            return 1U;
        }
        m0_fmc_dbg.last_result = result;
        m0_fmc_dbg.ignored_packets++;
    }

    m0_fmc_dbg.read_failures++;
    m0_fmc_dbg.last_result = result;
    fmc16_bridge_disable();
    return 0U;
}

int32_t M0_DataSource_SetMode(uint8_t mode)
{
    uint16_t tx_packet[FMC16_COMMAND_WORDS];
    uint16_t rx_packet[FMC16_MAX_PACKET_WORDS];
    size_t rx_words;
    uint32_t transaction;
    uint32_t packet_index;
    uint32_t i;
    M0_FmcResult result;

    if ((mode != 0U) && (mode != 11U))
    {
        return -1;
    }
    if (m0_fmc_dbg.initialized == 0U)
    {
        M0_DataSource_Init();
    }

    transaction = next_transaction_id++;
    m0_fmc_dbg.command_sequence = next_command_sequence;
    m0_fmc_dbg.transaction_id = transaction;
    m0_fmc_dbg.requested_mode = mode;
    fmc16_build_command(tx_packet, next_command_sequence++, transaction,
                        FMC16_OPCODE_SET_MODE, (uint16_t)mode);

    fmc16_bridge_enable();
    for (i = 0U; i < FMC16_COMMAND_WORDS; ++i)
    {
        fmc16_write_word(tx_packet[i]);
    }
    __DSB();

    result = M0_FMC_ERR_TIMEOUT;
    for (packet_index = 0U;
         packet_index < FMC16_MAX_PACKETS_PER_QUERY;
         ++packet_index)
    {
        rx_words = 0U;
        result = fmc16_capture_packet(rx_packet, &rx_words);
        m0_fmc_dbg.last_result = result;
        m0_fmc_dbg.last_packet_words = (uint16_t)rx_words;
        if (result != M0_FMC_OK)
        {
            if (result == M0_FMC_ERR_TIMEOUT)
            {
                break;
            }
            m0_fmc_dbg.ignored_packets++;
            continue;
        }
        m0_fmc_dbg.last_packet_type = (uint16_t)(rx_packet[4] >> 8);
        m0_fmc_dbg.last_packet_transaction =
            ((uint32_t)rx_packet[10] << 16) | rx_packet[11];
        result = fmc16_parse_mode_response(rx_packet, rx_words,
                                           transaction, mode);
        if (result == M0_FMC_OK)
        {
            active_data_mode = mode;
            physical_pi_requested = 0U;
            virtual_pi_toggle = 0U;
            virtual_key_state = 0U;
            if (FPGA_PI_Write(0U) == HAL_OK)
            {
                last_pi_applied = 0U;
                pi_driver_ready = 1U;
            }
            else
            {
                pi_driver_ready = 0U;
                m0_fmc_dbg.pi_i2c_error_count++;
            }
            m0_fmc_dbg.current_mode = mode;
            m0_fmc_dbg.mode_set_count++;
            m0_fmc_dbg.last_result = M0_FMC_OK;
            fmc16_bridge_disable();
            return 0;
        }
        m0_fmc_dbg.ignored_packets++;
    }

    m0_fmc_dbg.mode_set_error_count++;
    m0_fmc_dbg.last_result = result;
    fmc16_bridge_disable();
    return -2;
}

int32_t M0_DataSource_VirtualKeySet(uint8_t f_number,
                                   uint8_t pressed,
                                   uint32_t command_id)
{
    uint16_t state_bit;
    uint16_t next_key_state;
    uint16_t pi_bit;
    uint16_t target_pi;
    uint8_t was_pressed;

    if ((f_number < 1U) || (f_number > 10U) ||
        (pressed > 1U) ||
        (command_id == 0U))
    {
        m0_fmc_dbg.control_reject_count++;
        return -1;
    }
    if (command_id == last_control_id)
    {
        m0_fmc_dbg.control_duplicate_count++;
        return 1;
    }
    if ((last_control_id != 0U) &&
        (m0_sequence_is_newer(command_id, last_control_id) == 0U))
    {
        m0_fmc_dbg.control_reject_count++;
        return -2;
    }

    state_bit = (uint16_t)(1UL << (uint32_t)(f_number - 1U));
    was_pressed = ((virtual_key_state & state_bit) != 0U) ? 1U : 0U;

    next_key_state = virtual_key_state;
    if (pressed != 0U)
    {
        next_key_state |= state_bit;
    }
    else
    {
        next_key_state &= (uint16_t)~state_bit;
    }

