StanXYZ03/DigitalTwin/STM32/Core/Src/m0_data_source.c
    /* M11 is level based: press drives the selected PI high and release
     * drives it low.  This preserves long-press behavior and works with the
     * original point-matrix RTL's rising-edge detector. */
    if ((active_data_mode == 11U) && (f_number <= 9U))
    {
        target_pi = (uint16_t)(physical_pi_requested ^
                               (next_key_state & 0x01FFU));
        if ((pi_driver_ready == 0U) && (FPGA_PI_Init() == HAL_OK))
        {
            pi_driver_ready = 1U;
        }
        if ((pi_driver_ready == 0U) ||
            (FPGA_PI_Write(target_pi) != HAL_OK))
        {
            pi_driver_ready = 0U;
            m0_fmc_dbg.pi_i2c_error_count++;
            m0_fmc_dbg.control_reject_count++;
            return -3;
        }
        last_pi_applied = target_pi;
        if ((pressed != 0U) && (was_pressed == 0U))
        {
            virtual_key_count++;
        }
        virtual_key_state = next_key_state;
        last_control_id = command_id;
        m0_fmc_dbg.pi_virtual_toggle = virtual_pi_toggle;
        m0_fmc_dbg.virtual_key_state = virtual_key_state;
        m0_fmc_dbg.virtual_key_count = virtual_key_count;
        m0_fmc_dbg.last_control_id = last_control_id;
        return 0;
    }

    /* A down edge is the web equivalent of one physical press.  All ten
     * panel keys have a unique PI event bit.  Release updates held-state
     * telemetry but deliberately does not create a second experiment event. */
    pi_bit = 0U;
    if ((pressed != 0U) && (was_pressed == 0U))
    {
        pi_bit = m0_virtual_key_pi_bit(f_number);
    }

    if (pi_bit != 0U)
    {
        target_pi = (uint16_t)(last_pi_applied ^ pi_bit);
        if ((pi_driver_ready == 0U) && (FPGA_PI_Init() == HAL_OK))
        {
            pi_driver_ready = 1U;
        }
        if ((pi_driver_ready == 0U) ||
            (FPGA_PI_Write(target_pi) != HAL_OK))
        {
            pi_driver_ready = 0U;
            m0_fmc_dbg.pi_i2c_error_count++;
            m0_fmc_dbg.control_reject_count++;
            return -3;
        }
        last_pi_applied = target_pi;
        virtual_pi_toggle ^= pi_bit;
        virtual_key_count++;
    }

    virtual_key_state = next_key_state;
    last_control_id = command_id;
    m0_fmc_dbg.pi_virtual_toggle = virtual_pi_toggle;
    m0_fmc_dbg.virtual_key_state = virtual_key_state;
    m0_fmc_dbg.virtual_key_count = virtual_key_count;
    m0_fmc_dbg.last_control_id = last_control_id;
    return 0;
}
#endif
